/*/
Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.

m = 2, n = 3 -> A(m,n) = 9
m = 3, n = 2 -> A(m,n) = 29
/*/
Console.WriteLine("Введите число m");
int M = int.Parse(Console.ReadLine());

Console.WriteLine("Введите число n");
int N = int.Parse(Console.ReadLine());

